OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f27j53.h
#define _RB0                    0x01
#define _AN12                   0x01
#define _INT0                   0x01
#define _RP3                    0x01
#define _C3IND                  0x01
#define _RB1                    0x02
#define _AN10                   0x02
#define _RTCC                   0x02
#define _RP4                    0x02
#define _C3INC                  0x02
#define _RB2                    0x04
#define _AN8                    0x04
#define _CTED1                  0x04
#define _VMO                    0x04
#define _REFO                   0x04
#define _RP5                    0x04
#define _C2INC                  0x04
#define _RB3                    0x08
#define _AN9                    0x08
#define _CTED2                  0x08
#define _VPO                    0x08
#define _RP6                    0x08
#define _C3INA                  0x08
#define _RB4                    0x10
#define _KBI0                   0x10
#define _SCK1                   0x10
#define _SCL1                   0x10
#define _RP7                    0x10
#define _CCP4                   0x10
#define _RB5                    0x20
#define _KBI1                   0x20
#define _SDI1                   0x20
#define _SDA1                   0x20
#define _RP8                    0x20
#define _CCP5                   0x20
#define _RB6                    0x40
#define _KBI2                   0x40
#define _PGC                    0x40
#define _RP9                    0x40
#define _CCP6                   0x40
#define _RB7                    0x80
#define _KBI3                   0x80
#define _PGD                    0x80
#define _RP10                   0x80
#define _CCP7                   0x80

//==============================================================================


//==============================================================================
//        PORTC Bits

extern __at(0x0F82) __sfr PORTC;

typedef union
  {
  struct
    {
    unsigned RC0                : 1;
    unsigned RC1                : 1;
    unsigned RC2                : 1;
    unsigned                    : 1;
    unsigned RC4                : 1;
    unsigned RC5                : 1;
    unsigned RC6                : 1;
    unsigned RC7                : 1;
    };

  struct
    {
    unsigned T1OSO              : 1;
    unsigned T1OSI              : 1;
    unsigned AN11               : 1;
    unsigned                    : 1;
    unsigned D_MINUS            : 1;
    unsigned D_PLUS             : 1;
    unsigned TX1                : 1;
    unsigned RX1                : 1;
    };

  struct
    {
    unsigned T1CKI              : 1;
    unsigned NOT_UOE            : 1;
    unsigned CTPLS              : 1;
    unsigned                    : 1;
    unsigned VM                 : 1;
    unsigned VP                 : 1;
    unsigned CK1                : 1;
    unsigned DT1                : 1;
    };

  struct
    {
    unsigned RP11               : 1;
    unsigned RP12               : 1;
    unsigned RP13               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned RP17               : 1;
    unsigned SDO1               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned CCP8               : 1;
    unsigned C2IND              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP9               : 1;
    unsigned RP18               : 1;
    };

  struct
    {
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned CCP10              : 1;
    };
  } __PORTCbits_t;

extern __at(0x0F82) volatile __PORTCbits_t PORTCbits;

#define _RC0                    0x01
#define _T1OSO                  0x01
#define _T1CKI                  0x01
#define _RP11                   0x01
#define _RC1                    0x02
#define _T1OSI                  0x02
#define _NOT_UOE                0x02
#define _RP12                   0x02
#define _CCP8                   0x02
#define _RC2                    0x04
#define _AN11                   0x04
#define _CTPLS                  0x04
#define _RP13                   0x04
#define _C2IND                  0x04
#define _RC4                    0x10
#define _D_MINUS                0x10
#define _VM                     0x10
#define _RC5                    0x20
#define _D_PLUS                 0x20
#define _VP                     0x20
#define _RC6                    0x40
#define _TX1                    0x40
#define _CK1                    0x40
#define _RP17                   0x40
#define _CCP9                   0x40
#define _RC7                    0x80
#define _RX1                    0x80
#define _DT1                    0x80
#define _SDO1                   0x80
#define _RP18                   0x80
#define _CCP10                  0x80

//==============================================================================


//==============================================================================
//        HLVDCON Bits

extern __at(0x0F85) __sfr HLVDCON;

typedef union
  {
  struct
    {
    unsigned HLVDL0             : 1;
    unsigned HLVDL1             : 1;
    unsigned HLVDL2             : 1;
    unsigned HLVDL3             : 1;
    unsigned HLVDEN             : 1;
    unsigned IRVST              : 1;
    unsigned BGVST              : 1;
    unsigned VDIRMAG            : 1;
    };

  struct
    {
    unsigned HLVDL              : 4;
    unsigned                    : 4;
    };
  } __HLVDCONbits_t;

extern __at(0x0F85) volatile __HLVDCONbits_t HLVDCONbits;

#define _HLVDL0                 0x01
#define _HLVDL1                 0x02
#define _HLVDL2                 0x04
#define _HLVDL3                 0x08
#define _HLVDEN                 0x10
#define _IRVST                  0x20
#define _BGVST                  0x40
#define _VDIRMAG                0x80

//==============================================================================


//==============================================================================
//        DMACON2 Bits

extern __at(0x0F86) __sfr DMACON2;

typedef union
  {
  struct
    {
    unsigned INTLVL0            : 1;
    unsigned INTLVL1            : 1;
    unsigned INTLVL2            : 1;
    unsigned INTLVL3            : 1;
    unsigned DLYCYC0            : 1;
    unsigned DLYCYC1            : 1;
    unsigned DLYCYC2            : 1;
    unsigned DLYCYC3            : 1;
    };

  struct
    {
    unsigned INTLVL             : 4;
    unsigned                    : 4;
    };

  struct
    {
    unsigned                    : 4;
    unsigned DLYCYC             : 4;
    };
  } __DMACON2bits_t;

extern __at(0x0F86) volatile __DMACON2bits_t DMACON2bits;

